---
lab:
  title: 'Übung 06: Bedrohungssuche in Microsoft Sentinel durchführen'
  module: Guided Project - Create detections and perform investigations using Microsoft Sentinel
---

## Übersicht über die Übung

Sie sind als Security Operations Analyst für ein Unternehmen tätig, das Microsoft Sentinel implementiert hat. Sie müssen lernen, Bedrohungen mithilfe von Microsoft Sentinel zu erkennen und abzuwehren. Nachdem Sie Ihre Datenquellen mit Microsoft Sentinel verbunden haben, können Sie benutzerdefinierte Analyseregeln erstellen, um Bedrohungen und anomales Verhalten in Ihrer Umgebung zu erkennen.

Bedrohungssuche-Abfragen ermöglichen und ermöglichen SOC-Analysten, potenzielle Angriffe proaktiv zu überwachen und zu untersuchen, während sie sich entwickeln oder bevor sie geschehen. Die Suche innerhalb von Microsoft Sentinel ermöglicht Abfragen, die analytischen Regeln ähneln, um die Umgebung auf potenziell bösartige Aktivitäten zu überprüfen, während Analysten die Ergebnisse bei Bedarf zu Vorfällen eskalieren können. Manchmal werden für die Suche nach Bedrohungen Daten benötigt, die über die Aufbewahrung der Analyseebene (Hot Tier) hinausgehen. Hier können Funktionen wie Such-/Wiederherstellungsaufträge eingesetzt werden, um sicherzustellen, dass das SOC über die benötigten Daten verfügt.

## Übungsanweisungen

### Aufgabe 1: Erstellen einer Bedrohungssuchabfrage

In dieser Aufgabe werden Sie eine Jagdabfrage erstellen und ein Lesezeichen für ein Ergebnis setzen.

1. Melden Sie sich beim virtuellen Computer WIN1 als Administrator mit dem Kennwort **Pa55w.rd** an.  

1. Navigieren Sie im Edge-Browser zum Azure-Portal unter <https://portal.azure.com>.

1. Kopieren Sie im Dialogfeld **Anmelden** die **E-Mail vom Mandanten**, die Sie von Ihrem Labhostinganbieter erhalten haben, und wählen Sie **Weiter**.

1. Kopieren Sie im Dialogfeld **Kennwort eingeben** das **Kennwort des Mandanten**, das Sie von Ihrem Labhostinganbieter erhalten haben, und fügen Sie es ein. Wählen Sie dann **Anmelden**.

1. Geben Sie in der Suchleiste des Azure-Portals *Sentinel* ein, und wählen Sie dann ** Microsoft Sentinel** aus.

1. Wählen Sie Ihren Microsoft Sentinel-Arbeitsbereich aus.

1. Wählen Sie **Protokolle** aus.

1. Geben Sie die folgende KQL-Anweisung in das Feld *Neue Abfrage 1* ein:

   >**Wichtig:** Um Fehler zu vermeiden, fügen Sie bitte alle KQL-Abfragen zunächst in den Editor ein und kopieren Sie sie von dort in das Protokollfenster *Neue Abfrage 1*.

    ```KQL
    let lookback = 2d; 
    SecurityEvent 
    | where TimeGenerated >= ago(lookback) 
    | where EventID == 4688 and Process =~ "powershell.exe"
    | extend PwshParam = trim(@"[^/\\]*powershell(.exe)+" , CommandLine) 
    | project TimeGenerated, Computer, SubjectUserName, PwshParam 
    | summarize min(TimeGenerated), count() by Computer, SubjectUserName, PwshParam 
    | order by count_ desc nulls last 
    ```
